#include "Funct_Main.h"

void print_banner(const string& title)
{
    system("cls");
    cout << "\n";
    cout << "====================== Сваха ===========================\n";
    cout << "= " << setw(30) << title << " =\n";
    cout << "========================================================\n\n";
}
void show_menu(string& current_user)
{
    print_banner("Главное меню - " + current_user);
    cout << "====================== Выберите Действие ======================\n";
    cout << "= 1.  Загрузить пользователей                                 =\n";
    cout << "= 2.  Показать всех пользователей                             =\n";
    cout << "= 3.  Найти матчи для себя                                    =\n";
    cout << "= 4.  ТОП-матчи для всех                                      =\n";
    cout << "= 5.  Мои лайки                                               =\n";
    cout << "= 6.  Лайкнуть пользователя                                   =\n";
    cout << "= 7.  Убрать лайк                                             =\n";
    cout << "= 0.  Выход                                                   =\n";
    cout << "===============================================================\n";
    cout << " Ваш выбор: ";
}
void show_matches(vector<pair<double, string>>& matches, string& for_user) 
{
    print_banner(" ТОП-матчи для " + for_user);
    cout << "====================== РЕЙТИНГ СОВПАДЕНИЙ =====================\n";

    if (matches.empty()) 
    {
        cout << "= Нет подходящих кандидатов                              =\n";
        cout << "=  Загрузите пользователей и создайте предпочтения!       =\n";
    }
    else
    {
        for (int i = 0; i < matches.size() && i < 5; i++)
        {
            cout << "= " << (i + 1) << ".  " << matches[i].second;
            cout << " [" << matches[i].first << "%]  =\n";
        }
    }
    cout << "============================================================\n";   
}